src/oy25/conf/Documents/НачислениеПеней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>НачислениеПеней</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОплате</xr:Item>
				<xr:Item>InformationRegister.НачислениеПеней</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

src/oy25/conf/AccumulationRegisters/ЗадолженностьПоОплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Счет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy25/conf/InformationRegisters/НачислениеПеней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НачислениеПеней</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачисленияПеней</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Счет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy25/conf/Documents/НачислениеПеней/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗадолженностьПоОплате");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Движения.ЗадолженностьПоОплате.Очистить();
	Движения.ЗадолженностьПоОплате.Записать();
	Движения.ЗадолженностьПоОплате.Записывать = Истина;
	
	Движения.НачислениеПеней.Очистить();
	Движения.НачислениеПеней.Записать();
	Движения.НачислениеПеней.Записывать = Истина;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Задолженность.Контрагент КАК Контрагент,
		|	Задолженность.Счет КАК Счет,
		|	РАЗНОСТЬДАТ(НачислениеПеней.ДатаНачисленияПеней, &Дата, ДЕНЬ) * Задолженность.Счет.ПроцентПени / 100 * Задолженность.СуммаОстаток КАК Пени
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОплате.Остатки КАК Задолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеПеней.СрезПоследних КАК НачислениеПеней
		|		ПО Задолженность.Счет = НачислениеПеней.Счет
		|ГДЕ
		|	РАЗНОСТЬДАТ(НачислениеПеней.ДатаНачисленияПеней, &Дата, ДЕНЬ) > 0");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЗадолженностьПоОплате.ДобавитьПриход();
		Движение.Период		 = Дата;
		Движение.Контрагент	 = Выборка.Контрагент;
		Движение.Счет		 = Выборка.Счет;
		Движение.Сумма		 = Выборка.Пени;
		
		Движение = Движения.НачислениеПеней.Добавить();
		Движение.Период				 = Дата;
		Движение.Счет				 = Выборка.Счет;
		Движение.ДатаНачисленияПеней = Дата;
	КонецЦикла;
КонецПроцедуры
